WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_interrupt.c
/****************************************************************************
 * nuttx\configs\stm32f777zit6-meadow\src\meadow_interrupt.c
 * 
 *   Copyright (C) 2020, 2021, 2023, 2024, 2025 Wilderness Labs. All rights reserved.
 *   Author:  Wilderness Labs
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

// DEVELOPER NOTE:
// Debounce recognizes the first state transition and then ignores anything
//  after that for a period of time.
// Glitch filtering ignores the first state transition and waits a period of
//  time and then looks at state to make sure the result is stable

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include <string.h>
#include <stdbool.h>
#include <arch/board/board.h>
#include <arch/arch.h>
#include <nuttx/mqueue.h>
#include <errno.h>
#include "chip.h"
#include "stm32f777zit6-meadow.h"
#include <nuttx/timers/timer.h>
#include "stm32_tim.h"
#include <chip/stm32f76xx77xx_rcc.h>
#include <nuttx/clock.h>    // for testing
#include <nuttx/arch.h>
#include "meadow-upd.h"
#include "hcom_nx/hcom_nx_common.h"
#include "meadow_interrupt.h"
#include <meadow/meadow_hw_version.h>

#if defined (CONFIG_MEADOW_INTERRUPT_TESTS)
#pragma message "(--) meadow_interrupt.c"
#endif

// #define USE_MEADOW_DEBUG_HELPERS
#undef USE_MEADOW_DEBUG_HELPERS
#include <meadow/meadow_debug_helpers.h>

//============================================================
// Set == 0 to disable diagnostic output via syslog
// Set == 1 for I/O and config diagnostic output
// Set == 2 or > to output all diagnostic output
#define MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG (0)

// Arbitrary, large value, defining the maximum number of gpios that can be
// monitored.
#define MEADOW_INTERRUPT_MAX_SUPPORTED_GPIOS (32)

// Timer 7 is a basic timer with fewer features than other timer types
#define MEADOW_INTERRUPT_STM32F7_TIMER_NUMBER (7)

// Prescaler is be between 0 and 0xffff. A prescaler value of 0 to will
// not divide the input clock and a prescaler value of 1 will divide
// the clock by 2 etc.
// Timer 7's input clock is 96 MHz (1/2 of the STM32_SYSCLK_FREQUENCY speed).
// (prescaler + 1) * (auto reload register + 1) = TimerClock / frequency.
// The following values will give us a timer overflow interrupt every 0.1
// millisecond, which is the desired frequency
#define MEADOW_INTERRUPT_RUNNING_PSC (959)
#define MEADOW_INTERRUPT_RUNNING_ARR (9)

// This is a threshold at which any glitch duration greater than this value
// will use milliseconds timing instead of 100 usec timing.
#define MEADOW_INTERRUPT_GLITCH_TIME_USE_MS (200)    // 200 == 20 milliseconds

#if CONFIG_USEC_PER_TICK == 1000
#define MEADOW_INTERRUPT_TICK_MILLISEC_FACTOR (10)
#else
#define MEADOW_INTERRUPT_TICK_MILLISEC_FACTOR (1)
#endif

/****************************************************************************
 * Private Data
 ****************************************************************************/
static char *thisFile = __FILE__;

static mqd_t _mint_mqd;
static bool _firstTimeConfig = true;

// Current GPIO interrupt state
enum MeadowInterruptProcState_e
{
  mint_state_uncfg,           // not configured
  mint_state_wait_gpio_chg,   // waiting for an interrupt from a gpio
  mint_state_mon_glitch,      // gpio is being monitored for glitch timeout
  mint_state_mon_debounce,    // gpio is being monitored for debounce timeout
  mint_state_mon_no_delay     // gpio with no glitch or debounce delay
};

enum RequestedInterruptMode_e
{
  rqstdintmode_none,
  rqstdintmode_rising,
  rqstdintmode_falling,
  rqstdintmode_both
};

enum GlitchDebouceReturnValues_e
{
  glit_debo_ret_check_next_gpio,
  glit_debo_ret_no_timed_remain,
};

// All F7 possible input data registers addresses, used for ISR access to GPIO
// state value.
static uint32_t inputDataRegAddrs[] = 
{
  STM32_GPIOA_IDR,
  STM32_GPIOB_IDR,
  STM32_GPIOC_IDR,
  STM32_GPIOD_IDR,
  STM32_GPIOE_IDR,
  STM32_GPIOF_IDR,
  STM32_GPIOG_IDR,
  STM32_GPIOH_IDR,
  STM32_GPIOI_IDR,
  STM32_GPIOJ_IDR,
  STM32_GPIOK_IDR,
};
#define MEADOW_HW_INPUT_DATA_REGS_TOTAL (sizeof(inputDataRegAddrs) / sizeof(uint32_t))

// The following struct defines the information needed for debounce and glitch
// processing
struct interruptPinMap_s
{
  // Represents the CPU Pin identifier (e.g. PD9, D=3 so 39)
  uint8_t PinId;              // Supplied by configuration

  // What is the configuration type for this?
  // 0 = remove, 1 = new, 2 = low-power sleep wakeup
  uint8_t InputUsage;         // Supplied by configuration

  // Address of correct "Input Data Register" which holds GPIO's hardware port
  // state bits
  uint32_t IDRAddress;        // Calculated during configuration

