WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_interrupt.c
  // CurrentProcessState - tracks the current processing state for this GPIO
  // defined by an entry in MeadowInterruptProcState_e enum
  uint8_t CurrentProcessState;

  // Contains the configured interrupt mode: None = 0, Rising = 1, Falling = 2
  // and Both = 3.
  // Note: for mode 'None' configuration is not sent from Meadow.Core.
  uint8_t GpioRiseFallValue;   // Supplied by configuration

  // LastKnownGpioState - Last known GPIO state (often last reported).
  uint8_t LastKnownGpioState;    // 1 = high, 0 = low, 0xff = unknown

  // The number of debounce timer timeouts needed to satisfy user's config
  int32_t DebounceConfiguredDuration;   // Supplied by configuration

  // This counter counts the requested timeouts down to zero, this ends the
  // debounce period allowing new GPIO interrupts to be received and processing
  // to be repeated.
  uint32_t DebounceDownCounter;

  // The number of valid states that must be the same to declare this GPIO's
  // state to be stable.
  uint32_t GlitchConfiguredDuration;   // Supplied by configuration

  // The current number of times the state of the GPIO has been the same
  // without any state transitions.
  uint32_t GlitchTimeoutsCounter;

  // The previous GPIO state that we must be matched to be declared stable
  uint8_t GlitchPrevGpioState;

  // TimeProcessingBegan is used for glitch timing when the glitch duration
  // is beyond a certain limit and for diagnostics.
  uint32_t TimeProcessingBegan;
};

// This is the list of the GPIOs currently being timed. The entries in this
// list are very short lived, begin added as soon as the GPIO ISR is called and
// removed as soon as the glitch or debounce period has elapsed.
static struct interruptPinMap_s *_allGpiosBeingTimed[MEADOW_INTERRUPT_MAX_SUPPORTED_GPIOS];

// This list keeps the address of all the allocated structures so they can be
// removed when the GPIO is removed
static struct interruptPinMap_s *_allConfiguredGpios[MEADOW_INTERRUPT_MAX_SUPPORTED_GPIOS];

// Indicates the total number of GPIOs currently being timed.
static volatile int _allGpiosBeingTimedCnt = 0;

// Incremented and decrementd during configuration to indicate how many GPIOs
// need to be timed (only glitch and debounce GPIOs need to be timed).
static volatile int _totalGpiosCanBeTimed = 0;

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static int mint_gpio_no_delay_isr(int irq, void *context, void *arg);
static int mint_gpio_need_delay_isr(int irq, void *context, void *arg);
static int mint_config_interrupt_prep_timer(int stm32_timer_numb);
static inline int mint_forward_interrupt_to_core(struct interruptPinMap_s *gpioInfoAddr, uint8_t state);
static int mint_process_gpio_debounce(struct interruptPinMap_s *gpioInfoAddr);
static int mint_process_gpio_glitch(struct interruptPinMap_s *gpioInfoAddr);
static int mint_meadow_debounce_notification_logic(struct interruptPinMap_s *gpioInfoAddr);
static inline uint8_t mint_read_current_gpio_state(struct interruptPinMap_s *gpioInfoAddr);
static int mint_isr_periodic(int irq, void *context, void *arg);
static void mint_add_to_timed_list_and_incr(struct interruptPinMap_s *gpioInfoAddr);
static void mint_remove_from_timed_list_and_decr(struct interruptPinMap_s *gpioInfoAddr);
static void meadow_timer_enable(uint32_t timerBase);
static int mint_config_interrupt_remove(struct mint_gpio_int_config* cfg,
          struct interruptPinMap_s *gpioInfoAddr);
static int mint_config_interrupt_new(struct mint_gpio_int_config* cfg,
          struct interruptPinMap_s *gpioInfoAddr, uint32_t cfgset);

// Basic timers need to turn on/off the timer a different way 
static void turn_periodic_timer_on(void);
static void turn_periodic_timer_off(void);

/****************************************************************************
 * Private Functions
 ****************************************************************************/
// Initialization for meadow interrupt queue for writing
int meadow_interrupt_setup(void)
{
  // Open the mq used to pass interrupts to Meadow.Core
  struct mq_attr attr;
  attr.mq_flags = 0;
  attr.mq_maxmsg = MINT_MSG_QUEUE_MAX_MSGS;
  attr.mq_msgsize = MEADOW_INTERRUPT_MQ_MSG_SIZE;
  attr.mq_curmsgs = 0;

  _mint_mqd = mq_open(MINT_MSG_QUEUE_NAME, O_WRONLY | O_CREAT, 0660, &attr);
  if (_mint_mqd == (mqd_t)-1)
  {
    int errcode = get_errno();
    syslog(LOG_ERR, "%s@%d-mq_open failed: %d\n", __FILE__, __LINE__, errcode);
    return -errcode;
  }

  return OK;
}

//=============================================================================
void meadow_interrupt_shutdown(void)
{
  if(_mint_mqd != (mqd_t)-1)
  {
    mq_close(_mint_mqd);
    _mint_mqd = (mqd_t)-1;
  }
}

//=============================================================================
// This ISR handles the case where a GPIO needs no delay, we notify Meadow.Core
// of the interrupt immediately
int mint_gpio_no_delay_isr(int irq, void *context, void *arg)
{
  DEBUG_SET_HIGH(DEBUG_PIN_V2_A1);

  struct interruptPinMap_s *gpioInfoAddr = (struct interruptPinMap_s *)arg;

  // Properly setup?
  if(gpioInfoAddr == NULL)
  {
    syslog(LOG_ERR, "%s@%d-gpioInfoAddr == NULL\n", __FILE__, __LINE__);
    DEBUG_SET_LOW(DEBUG_PIN_V2_A1);
    return OK;
  }

#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 0
    syslog(LOG_INFO, "mint-(no delay)-0x%02x (P%c%d)- A 'no_delay' interrupt received, state:%d (5)\n",
            gpioInfoAddr->PinId,
            ((gpioInfoAddr->PinId) >> 4) + 'A', gpioInfoAddr->PinId & 0x0f,
            gpioInfoAddr->CurrentProcessState);
#endif

  if(gpioInfoAddr->CurrentProcessState != mint_state_mon_no_delay)
  {
    syslog(LOG_ERR, "%s@%d-PinId:0x%02x 'no_delay' interrupt but not mint_state_mon_no_delay\n",
            __FILE__, __LINE__, gpioInfoAddr->PinId);
    DEBUG_SET_LOW(DEBUG_PIN_V2_A1);
    return OK;
  }

  if(gpioInfoAddr->InputUsage == gpio_intrpt_cfg_type_wakeup)
  {
    // Execute the generic code that restarts the F7's internal clocks etc.
    // and then return. The thread that put things into sleep mode will do the
    // rest of the things needed to fully restore normal operations.
    int ret = pwrmgmt_isr_gpio_wakeup_code();
    DEBUG_SET_LOW(DEBUG_PIN_V2_A1);
    return ret;
  }

