WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_interrupt.c
  // Configured for neither glitch or debounce delay, so send ASAP.
  uint8_t currentState = mint_read_current_gpio_state(gpioInfoAddr);
  mint_forward_interrupt_to_core(gpioInfoAddr, currentState);

  DEBUG_SET_LOW(DEBUG_PIN_V2_A1);
  return OK;
}

//=============================================================================
// This ISR is called for all GPIO state changes for GPIOs needing glitch or
// debounce filtering and a transition of one of those GPIO pins has occurred.
// GPIOs not needing glitch nor debounce filtering use a different ISR.
int mint_gpio_need_delay_isr(int irq, void *context, void *arg)
{  
  struct interruptPinMap_s *gpioInfoAddr = (struct interruptPinMap_s *)arg;

  DEBUG_SET_HIGH(DEBUG_PIN_V2_A2);

  // Is this GPIO setup?
  if(gpioInfoAddr == NULL)
  {
    syslog(LOG_ERR, "%s@%d-gpioInfoAddr == NULL. This indicates coding problem\n",
            __FILE__, __LINE__);
    return OK;
  }

#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 1
    syslog(LOG_INFO, "mint-(delay)-0x%02x (P%c%d)- received delay targeted interrupt\n",
            gpioInfoAddr->PinId,
            ((gpioInfoAddr->PinId) >> 4) + 'A', gpioInfoAddr->PinId & 0x0f);
#endif

  // If not waiting for GPIO state change, ignore. This will be only GPIOs
  // for which glitch and/or debounce timing is actively being timed already.
  if(gpioInfoAddr->CurrentProcessState != mint_state_wait_gpio_chg)
  {
#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 1
    syslog(LOG_INFO, "mint-(delay)--PinId:0x%02x ignored, not waiting for GPIO change\n", gpioInfoAddr->PinId);
#endif

    DEBUG_SET_LOW(DEBUG_PIN_V2_A2);
    return OK;
  }

  //---------------------------------------------------------------------------
  // The remainder of this code will set things up so this GPIO can be
  // filtered. After being setup this GPIO will be ignored until the glitch /
  // debounce filtering is finished.
  if(gpioInfoAddr->GlitchConfiguredDuration > 0)
  {
    // Setup for ---glitch monitoring---
    DEBUG_SET_HIGH(DEBUG_PIN_V2_A3);

#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 1
    syslog(LOG_INFO, "mint-(delay)--PinId:0x%02x, Process glitch\n", gpioInfoAddr->PinId);
#endif

    // If both glitch and debounce configured, glitch always runs before
    // debounce. After the glitch filtering is finished then the debounce
    // filtering will begin.
    gpioInfoAddr->GlitchTimeoutsCounter = 0;
    gpioInfoAddr->CurrentProcessState = mint_state_mon_glitch;

    mint_add_to_timed_list_and_incr(gpioInfoAddr);

    // Start timer if not running
    turn_periodic_timer_on();
  }
  else if(gpioInfoAddr->DebounceConfiguredDuration > 0)
  {
    // Setup for ---debounce monitoring---
    DEBUG_SET_HIGH(DEBUG_PIN_V2_A3);
    
#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 1
    syslog(LOG_INFO, "mint-(delay)--PinId:0x%02x, Process debounce\n", gpioInfoAddr->PinId);
#endif

    gpioInfoAddr->DebounceDownCounter = gpioInfoAddr->DebounceConfiguredDuration;
    gpioInfoAddr->CurrentProcessState = mint_state_mon_debounce;

    mint_add_to_timed_list_and_incr(gpioInfoAddr);

    // Start timer if not running
    turn_periodic_timer_on();
  }
  else
  {
    // The configured duration for both glitch and debounce duration is == 0?
    // This is illegal as this ISR is only for GPIOs using glitch or debounce
    // filtering which is indicated by their configured duration being > 0.
    syslog(LOG_ERR, "%s@%d-Wrong ISR mint_gpio_need_delay_isr called\n", __FILE__, __LINE__);
    usleep(20 * 1000);
    ASSERT(false);
  }

  DEBUG_SET_LOW(DEBUG_PIN_V2_A2);
  return OK;
}

//===============================================================
// This ISR is called every 100 microseconds when the timer is running, which
// is only when it needs to run to time reporting an interrupt.
int mint_isr_periodic(int irq, void *context, void *arg)
{
  int result;
  struct interruptPinMap_s *gpioInfoAddr = (struct interruptPinMap_s *)arg;

  DEBUG_SET_HIGH(DEBUG_PIN_V2_A0);

  // Acknowledge the timer interrupt.
  uint16_t timStatusReg = getreg16(STM32_TIM7_BASE + STM32_BTIM_SR_OFFSET);
  timStatusReg &= ~BTIM_SR_UIF;
  putreg16(timStatusReg, STM32_TIM7_BASE + STM32_BTIM_SR_OFFSET);

  // In the case where the timer was disable, but the call to this function
  // was already in flight, this code will prevent any unwanted side-effects.
  if(_allGpiosBeingTimedCnt == 0)
  {
    DEBUG_SET_LOW(DEBUG_PIN_V2_A0);
    return OK;
  }

  // Check all GPIOs currently being timed.
  int offset = 0;
  while(_allGpiosBeingTimed[offset] != NULL)
  {
    gpioInfoAddr = _allGpiosBeingTimed[offset++];

    if(gpioInfoAddr->CurrentProcessState == mint_state_mon_debounce)
    {
      //----- Debounce Filtering -----
      result = mint_process_gpio_debounce(gpioInfoAddr);
      if(result == glit_debo_ret_check_next_gpio)
        continue;     // At least 1 active GPIO to time

      // Last GPIO to be timed just finished
      if(result == glit_debo_ret_no_timed_remain)
        break;
    }

    if(gpioInfoAddr->CurrentProcessState == mint_state_mon_glitch)
    {
      //----- Glitch Filtering -----
      result = mint_process_gpio_glitch(gpioInfoAddr);
      if(result == glit_debo_ret_check_next_gpio)
        continue;     // At least 1 active GPIO to time

      // Last GPIO to be timed just finished
      if(result == glit_debo_ret_no_timed_remain)
        break;
    }

    // Should never reach here as only debounce and glitch filtering need to
    // be timed.
    syslog(LOG_ERR, "Invalid process state %d detected\n",
              gpioInfoAddr->CurrentProcessState);
    usleep(20 * 1000);
    PANIC();
  }

  // Stop Timer if no GPIO needs timing
  if(_allGpiosBeingTimedCnt == 0)
  {
    turn_periodic_timer_off();
  }

  DEBUG_SET_LOW(DEBUG_PIN_V2_A0);

  return OK;
}

//========================================================================
// Process debounce here.  Called by periodic timeout.
int mint_process_gpio_debounce(struct interruptPinMap_s *gpioInfoAddr)
{
  if(gpioInfoAddr->DebounceDownCounter == gpioInfoAddr->DebounceConfiguredDuration)
  {
    // This is the first time to process this debounce filter request

#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 1
    syslog(LOG_INFO, "mint-(debo)-0x%02x DEBOUNCE Starting\n", gpioInfoAddr->PinId);
    gpioInfoAddr->TimeProcessingBegan = clock_systimer();
#endif

