WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_interrupt.c
    // In the case both Glitch and Debounce are requested, Glitch has
    // already sent the interrupt, if it's going to. Only if Glitch does
    // send an interrupt and debounce duration is > 0, will Debounce keep
    // new interrupts inactive until debounce duration has elasped.
    if(gpioInfoAddr->GlitchConfiguredDuration == 0)
    {
      // Glitch filtering not configured but Debounce was, so send
      // interrupt now.
      mint_meadow_debounce_notification_logic(gpioInfoAddr);
    }
#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 1
    else
    {
      syslog(LOG_INFO, "mint-(debo)-0x%02x Debounce started following Glitch\n", gpioInfoAddr->PinId);
    }
#endif
  }

  // This is the start of Debounce processing.
  // Step one is to notify the Meadow.Core by sending an interrupt, unless one
  // already sent by glitch filtering. Ignoring all GPIO state transitions
  // until the specified amount of time has elasped.

  // Decrement the timeout count. When it reaches 0, re-enbled the gpio interrupts.
  gpioInfoAddr->DebounceDownCounter--;
  if(gpioInfoAddr->DebounceDownCounter > 0)
    return glit_debo_ret_check_next_gpio;   // Not done yet

#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 1
  uint32_t procTime = clock_systimer() - gpioInfoAddr->TimeProcessingBegan;
  syslog(LOG_INFO, "mint-(debo)-0x%02x Debounce proccessing ended in %d ms\n",
            gpioInfoAddr->PinId, procTime);
#endif

  // Finished with debounce timing. Since the GPIO state should now be stable,
  // save it for next time, especially for rqstdintmode_both
  gpioInfoAddr->LastKnownGpioState = mint_read_current_gpio_state(gpioInfoAddr);

  // Terminate this GPIO's capture by removing from the list and changing the
  // processing state.
  mint_remove_from_timed_list_and_decr(gpioInfoAddr);

  // Reset the state so the next GPIO state changes will begin the timing
  // process once again.
  gpioInfoAddr->CurrentProcessState = mint_state_wait_gpio_chg;

  if(_allGpiosBeingTimedCnt == 0)
    return glit_debo_ret_no_timed_remain;  // No more work to do, so quit loop too

  return glit_debo_ret_check_next_gpio;   // Go to next gpio
}

//========================================================================
// Glitch filtering is processed here. Called by periodic timeout.
int mint_process_gpio_glitch(struct interruptPinMap_s *gpioInfoAddr)
{
  if(gpioInfoAddr->GlitchTimeoutsCounter == 0)
  {
    // First time to process glitch or restarting after glitch detected
#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 1
    syslog(LOG_INFO, "mint-(glitch)-0x%02x Glitch Starting\n", gpioInfoAddr->PinId);
#endif
    gpioInfoAddr->TimeProcessingBegan = clock_systimer();
  }

  gpioInfoAddr->GlitchTimeoutsCounter++;

  // If GlitchConfiguredDuration is greater than
  // MEADOW_INTERRUPT_GLITCH_TIME_USE_MS we use time based, not count
  // based to establish completion. This is because using counts is more
  // accurate for short delays (having 100 usec resolution). And long delays
  // accumulate an increasing error. Also, if GlitchConfiguredDuration is
  // greater than MEADOW_INTERRUPT_GLITCH_TIME_USE_MS we'll only read
  // the GPIO state every millisecond not every timer interrupt.
  if(gpioInfoAddr->GlitchConfiguredDuration > MEADOW_INTERRUPT_GLITCH_TIME_USE_MS)
  {
    // Using sys time so check about every millisecond not every 100 microseconds.
    if(gpioInfoAddr->GlitchTimeoutsCounter % MEADOW_INTERRUPT_TICK_MILLISEC_FACTOR != 0)
      return glit_debo_ret_check_next_gpio;
  }

  uint8_t currentState = mint_read_current_gpio_state(gpioInfoAddr);

  if(currentState != gpioInfoAddr->GlitchPrevGpioState)
  {
    // GPIO state has changed from previous, save the new state and restart
    // the timer.
    gpioInfoAddr->TimeProcessingBegan = clock_systimer();
    gpioInfoAddr->GlitchTimeoutsCounter = 0;
    gpioInfoAddr->GlitchPrevGpioState = currentState;

#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 1
    syslog(LOG_INFO, "mint-(glitch)-0x%02x Glitch state changed was:%d now:%d\n",
          gpioInfoAddr->PinId, gpioInfoAddr->GlitchPrevGpioState, currentState);
#endif
    return glit_debo_ret_check_next_gpio;   // Keep waiting
  }

  // GPIO State stable since last check?
  if(gpioInfoAddr->GlitchConfiguredDuration > MEADOW_INTERRUPT_GLITCH_TIME_USE_MS)
  {
    // Check elapsed time based on sys clock
    uint32_t elapedTimeMs = clock_systimer() - gpioInfoAddr->TimeProcessingBegan;
    if(elapedTimeMs < gpioInfoAddr->GlitchConfiguredDuration/MEADOW_INTERRUPT_TICK_MILLISEC_FACTOR)
      return glit_debo_ret_check_next_gpio;   // Not done yet
  }
  else
  {
    // Check elapsed time based on 100 usec timer
    if(gpioInfoAddr->GlitchTimeoutsCounter < gpioInfoAddr->GlitchConfiguredDuration)
      return glit_debo_ret_check_next_gpio;   // Need to keep checking
  }

  // We've found a stable state!
  // Finished checking, GPIO state stable for filter time.
#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 1
  uint32_t totalTime = clock_systimer() - gpioInfoAddr->TimeProcessingBegan;
  syslog(LOG_INFO, "mint-(glitch)-0x%02x Glitch completed in %d ms, timeouts:%d\n",
          gpioInfoAddr->PinId, totalTime, gpioInfoAddr->GlitchTimeoutsCounter);
#endif

  // Need to determine if an interrupt notification needs to be sent to
  // Meadow.Core.
  if(gpioInfoAddr->LastKnownGpioState != currentState)
  {
    bool isRising = gpioInfoAddr->LastKnownGpioState < currentState;
    switch(gpioInfoAddr->GpioRiseFallValue)
    {
      case rqstdintmode_both:
#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 1
        syslog(LOG_INFO, "mint_(glitch)-0x%02x Notifying Meadow.Core, rqstdintmode_both\n", gpioInfoAddr->PinId);
#endif
        mint_forward_interrupt_to_core(gpioInfoAddr, currentState);
        break;

      case rqstdintmode_falling:
        if(!isRising)
        {
#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 1
          syslog(LOG_INFO, "mint_(glitch)-0x%02x Notifying, Falling and config rqstdintmode_falling\n", gpioInfoAddr->PinId);
#endif
          mint_forward_interrupt_to_core(gpioInfoAddr, currentState);
        }
#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 1
        else
        {
          syslog(LOG_INFO, "mint_(glitch)-0x%02x ignoring, Rising but config rqstdintmode_falling\n", gpioInfoAddr->PinId);
        }
#endif
        break;

      case rqstdintmode_rising:
        if(isRising)
        {
#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 1
          syslog(LOG_INFO, "mint_(glitch)-0x%02x Notifying, Rising and config rqstdintmode_rising\n", gpioInfoAddr->PinId);
#endif
          mint_forward_interrupt_to_core(gpioInfoAddr, currentState);
        }
#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 1
        else
        {
          syslog(LOG_INFO, "mint_(glitch)-0x%02x Ignoring, Falling but config rqstdintmode_rising\n", gpioInfoAddr->PinId);
        }
#endif
        break;

      default:
      case rqstdintmode_none:
        syslog(LOG_ERR, "%s@%d-0x%02x illegal interrupt mode:%d\n",
                  __FILE__, __LINE__, gpioInfoAddr->PinId, gpioInfoAddr->GpioRiseFallValue);
        break;
    }
  }
#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 0
  else
  {
    // gpioInfoAddr->LastKnownGpioState == currentState i.e. no change. It's a glitch, ignore it
    syslog(LOG_INFO, "mint_(glitch)-0x%02x No GPIO state change-Ignore\n", gpioInfoAddr->PinId);
  }
#endif

  gpioInfoAddr->LastKnownGpioState = currentState;

  //---------------------------------------------------------------------------
  // We reached the end of the glitch filtering time requested. What should be
  // done? Should we switch to debounce filtering or end filtering for this
  // GPIO.
  if(gpioInfoAddr->DebounceConfiguredDuration > 0)
  {
    // Debounce is configured to follow the glitch filtering
    gpioInfoAddr->DebounceDownCounter = gpioInfoAddr->DebounceConfiguredDuration;
    gpioInfoAddr->CurrentProcessState = mint_state_mon_debounce;

   // Move to next GPIO (the debounce will be processed next time)
   return glit_debo_ret_check_next_gpio;
  }
  else
  {
    // Remove this GPIO from being timed
    mint_remove_from_timed_list_and_decr(gpioInfoAddr);

    // Reset the state so the next GPIO state change will begin the timing
    // process again.
    gpioInfoAddr->CurrentProcessState = mint_state_wait_gpio_chg;

    if(_allGpiosBeingTimedCnt == 0)
      return glit_debo_ret_no_timed_remain;  // No more work to do, so quit loop too
  }

