WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_interrupt.c
  return glit_debo_ret_check_next_gpio;
}

//==================================================================
// This code is only used for notifying Meadow.Core for debounce
int mint_meadow_debounce_notification_logic(struct interruptPinMap_s *gpioInfoAddr)
{
  uint8_t newState;
  
#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 1
  syslog(LOG_INFO, "mint-(debounce)-0x%02x Debounce alone, no Glitch\n", gpioInfoAddr->PinId);
#endif

  switch(gpioInfoAddr->GpioRiseFallValue)
  {
    // Perfect debounce filtering is not possible due to the MCU not providing the GPIO
    // state that originally generated the interrupt. Therefore, we must assume that the
    // user is using it correctly and they understand what applications are appropriate.
    // All this is because we cannot accurately read the GPIO state at the instant we receive
    // the interrupt notification, it may have changed. If the desired interrupt mode is
    // 'rising' or 'falling' we assume the state based on the configuration, depending on
    // the MCU to only send the requested types. In the case of 'both' we have no choice
    // but to assume that the last known state was valid and send the opposite state.
    case rqstdintmode_both:
      // Assume the opposite state, that's the best we can do.
      // The LastKnownGpioState was updated after the debounce timeout period.
      newState = gpioInfoAddr->LastKnownGpioState == 1 ? 0 : 1;
#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 1
      syslog(LOG_INFO, "mint-(debounce)-0x%02x--Notifying 0x%02x rqstdintmode_both \n", gpioInfoAddr->PinId, newState);
#endif
      mint_forward_interrupt_to_core(gpioInfoAddr, newState);
      break;

    case rqstdintmode_falling:
      newState = 0;      // Assume high to low transition
#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 1
      syslog(LOG_INFO, "mint-(debounce)-0x%02x--Notifying 0x%02x rqstdintmode_falling\n", gpioInfoAddr->PinId, 0);
#endif
      mint_forward_interrupt_to_core(gpioInfoAddr, newState);
      break;

    case rqstdintmode_rising:
      newState = 1;      // Assume low to high transition
#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 1
      syslog(LOG_INFO, "mint-(debounce)-0x%02x--Notifying 0x%02x rqstdintmode_rising\n", gpioInfoAddr->PinId, 1);
#endif
      mint_forward_interrupt_to_core(gpioInfoAddr, 1);
      break;

    case rqstdintmode_none:
    default:
      syslog(LOG_ERR, "%s@%d-0x%02x unexpected case:%d\n",
              __FILE__, __LINE__, gpioInfoAddr->PinId, gpioInfoAddr->GpioRiseFallValue);
      break;
  }
  return OK;
}

//===============================================================
// Forward interrupt info to Meadow.Core
// This function will forward:
// 1. PinId - upper 4-bits GPIO port, lower 4-bits GPIO pin
// 2. State - 0 = false, 1 = true
// 3. If MEADOW_INTERRUPT_INCLUDE_TIME_STAMP = 1, Tick count since OS started
//    (Note: using Nuttx ticks is subject to change)
int mint_forward_interrupt_to_core(struct interruptPinMap_s *gpioInfoAddr,
  uint8_t state)
{
  int ret;
  mint_send_int_core_t mint_send_msg;

  // Timing must be finished
  DEBUG_SET_LOW(DEBUG_PIN_V2_A3);

  // Forward interrupt info to Meadow.Core
  // The first byte  are the same if we add interrupt time or not
  mint_send_msg.gpioPinId = gpioInfoAddr->PinId;  // port/pin of interrupt
  mint_send_msg.gpioState = state;                // GPIO state
#if (MEADOW_INTERRUPT_INCLUDE_TIME_STAMP > 0)
  mint_send_msg.interruptTicks = clock_systimer();
#endif

  // At this time (05Dec25) no time information is being sent. The code that
  // will be built if MEADOW_INTERRUPT_INCLUDE_TIME_STAMP is set to 1 will be
  // the number of Nuttx ticks since startup. The entent is to have a
  // framework here that can be easily modified to supply any type of
  // timestamp Managed code can use best.
  //
  // Here is an possible (untested) implementation for the current time
  //
  // struct tm tmTime = {0};
  // time_t secTime;         // uint32_t
  // uint64_t secTime;
  // int64_t nanoseconds;
  // int64_t secPlusMs;
  // int64_t timeUS;

  // #ifdef CONFIG_STM32F7_HAVE_RTC_SUBSECONDS
  //   ret = up_rtc_getdatetime_with_subseconds(&tmTime,
         // (long int *)&nanoseconds);
  // #endif
  //   // Convert struct tm to seconds
  //   secTime = (time_t)mktime(&tmTime);
  //   secPlusMs = (secTime * 1000   ) + (nanoseconds / (1000 * 1000));
  //   // timeUS = (secTime * 1000000) + (nanoseconds / 1000);
  //
  //   syslog(1, "------------------------------------\n");
  //   syslog(1, "Sizes:secTime:%lu, nanoseconds:%lu, secPlusMs:%lu\n",
  //     sizeof(secTime), sizeof(nanoseconds), sizeof(secPlusMs));
  //
  //   Wed Oct  1 17:21:03 2025
  //   syslog(1, "UTC:%s", ctime((time_t *) &secTime));
  //   syslog(1, "nanoseconds :%020lld\n", nanoseconds);
  //   syslog(1, "milliseconds:%020lld\n", nanoseconds / (1000 * 1000));
  //   syslog(1, "Seconds     :%020lld\n", secTime);
  //   syslog(1, "Sec+MilliSec:%020lld, Sec:%lld, MS::%lld\n",
  // syslog(1, "Sec+MicroSec:%020lld\n", timeUS);
  //     secPlusMs, secPlusMs / 1000, secPlusMs % (1000 * 1000));

  ret = mq_send(_mint_mqd, (char *) &mint_send_msg,
    MEADOW_INTERRUPT_MQ_MSG_SIZE, 0);
  if(ret < 0)
  {
    if(errno == ENOMEM)
    {
      syslog(LOG_ERR, "0x%02x Queue overflow (too fast?)\n", gpioInfoAddr->PinId);
    }
    else
    {
      syslog(LOG_ERR, "%s@%d-0x%02x mq_send failed:%d, errno:%d\n", __FILE__, __LINE__, 
          gpioInfoAddr->PinId, ret, get_errno());
    }
  }

  return ret;
}

//===============================================================
uint8_t mint_read_current_gpio_state(struct interruptPinMap_s *gpioInfoAddr)
{
  uint8_t pinNumb = gpioInfoAddr->PinId & 0x0f;
  uint32_t idrRegisterValues = *((uint32_t *)(gpioInfoAddr->IDRAddress));
  return (idrRegisterValues & (1 << pinNumb)) > 0 ? 1 : 0;
}

//===============================================================
// When an interrupt occurs that must be monitored it is added to this
// list. This list is used by the periodic ISR to time glitch and debounce
// activity. Once the timing has completed it is removed from this list.
void mint_add_to_timed_list_and_incr(struct interruptPinMap_s *gpioInfoAddr)
{
  // Find first empty slot
  for(int i = 0; i < MEADOW_INTERRUPT_MAX_SUPPORTED_GPIOS; i++)
  {
    if(_allGpiosBeingTimed[i] == NULL)
    {
      _allGpiosBeingTimed[i] = gpioInfoAddr;
      _allGpiosBeingTimedCnt++;
      break;
    }
  }
}

//===============================================================
// We need to save the address of all allocated memory so it can be freed
// when the GPIO is removed.
static int mint_add_new_gpio_to_allocation_list(
            struct interruptPinMap_s *gpioInfoAddr)
{
  for(int i = 0; i < MEADOW_INTERRUPT_MAX_SUPPORTED_GPIOS; i++)
  {
    // Find unused slot
    if(_allConfiguredGpios[i] == NULL)
    {
      _allConfiguredGpios[i] = gpioInfoAddr;
      return OK;
    }
  }
  return -ENOSPC;   // No space
}

//===============================================================
// When removing a GPIO we must find it's memory so it can be freed
static int mint_free_gpio_in_allocation_list(uint8_t pinId)
{
  for(int i = 0; i < MEADOW_INTERRUPT_MAX_SUPPORTED_GPIOS; i++)
  {
    // If NULL continue
    if(_allConfiguredGpios[i] == NULL)
      continue;

