WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_interrupt.c
    // Match the allocation
    if(_allConfiguredGpios[i]->PinId == pinId)
    {
      free(_allConfiguredGpios[i]);
      _allConfiguredGpios[i] = NULL;
      return OK;
    }
  }

  return -ENODATA;
}

//===============================================================
// Removes from the timer isr
void mint_remove_from_timed_list_and_decr(struct interruptPinMap_s *gpioInfoAddr)
{
  int activeOffset;

  // Find the entry specified
  for(activeOffset = 0; activeOffset < MEADOW_INTERRUPT_MAX_SUPPORTED_GPIOS; activeOffset++)
  {
    if(_allGpiosBeingTimed[activeOffset] == gpioInfoAddr)
      break;
  }

  // Was the item in the list?
  if(activeOffset == MEADOW_INTERRUPT_MAX_SUPPORTED_GPIOS)
    return;  // Not found

  // Keep tally of entries
  _allGpiosBeingTimedCnt--;

  // Is this the only entry?
  if(activeOffset == _allGpiosBeingTimedCnt)
  {
    // Remove the last entry in the array
    _allGpiosBeingTimed[activeOffset] = NULL;
    return;
  }
 
  // Compress the list by moving the last entry in the list to the slot we
  // are about to remove and then clearing the last slot.
  _allGpiosBeingTimed[activeOffset] = _allGpiosBeingTimed[_allGpiosBeingTimedCnt];
  _allGpiosBeingTimed[_allGpiosBeingTimedCnt] = NULL;
  return;
}

//=============================================================================
// Timer setup is here. This should only be called once to prepare timer for
// for periodic operation.
// Note: Timers 6 & 7 are Basic Timers. Timer 6 can be used to measure CPU idle
// time and Timer 7 is used here. Since neither timer has any GPIO this means
// other timers can be used for GPIO related work.
static int mint_config_interrupt_prep_timer(int stm32_timer_numb)
{
  int ret;
  
  // Setup the clock enable
  modifyreg32(STM32_RCC_APB1ENR, 0, RCC_APB1ENR_TIM7EN);
  
  // Set prescaler and auto reload register to determine timer interrupt period
  putreg16(MEADOW_INTERRUPT_RUNNING_PSC, STM32_TIM7_BASE + STM32_BTIM_PSC_OFFSET);
  putreg16(MEADOW_INTERRUPT_RUNNING_ARR, STM32_TIM7_BASE + STM32_BTIM_ARR_OFFSET);

  uint16_t regval = getreg16(STM32_TIM7_BASE + STM32_BTIM_CR1_OFFSET);
  regval |= BTIM_CR1_ARPE;    // Auto Reload Pre-Load enable bit
  putreg16(regval, STM32_TIM7_BASE + STM32_BTIM_CR1_OFFSET);

  // Timer 7 only supports UIE interrupt
  putreg16(BTIM_DIER_UIE, STM32_TIM7_BASE + STM32_BTIM_DIER_OFFSET);

  // The ISR for periodic interupt for timing, will roll-over every 65536
  // counts.
  ret = irq_attach(STM32_IRQ_TIM7, mint_isr_periodic, NULL);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-irq_attach failed, ret:%d, errno:%d\n",
          __FILE__, __LINE__, ret, errno);
    return ret;
  }

  // Clear interrupt bit
  uint16_t timStatusReg = getreg16(STM32_TIM7_BASE + STM32_GTIM_SR_OFFSET);
  timStatusReg &= ~BTIM_SR_UIF;
  putreg16(timStatusReg, STM32_TIM7_BASE + STM32_GTIM_SR_OFFSET);

  up_enable_irq(STM32_IRQ_TIM7);

  meadow_timer_enable(STM32_TIM7_BASE);

  return OK;
}

//=============================================================
// Enables the timer
void meadow_timer_enable(uint32_t timerBase)
{
  // Why this order? tryed to copy the NUTTX order
  uint16_t cr1Val = getreg16(timerBase + STM32_GTIM_CR1_OFFSET);
  cr1Val |= GTIM_CR1_CEN;
  
  uint16_t egrVal = getreg16(timerBase + STM32_GTIM_EGR_OFFSET);
  egrVal |= GTIM_EGR_UG;

  putreg16(egrVal, timerBase + STM32_GTIM_EGR_OFFSET);

  putreg16(cr1Val, timerBase + STM32_GTIM_CR1_OFFSET);
}

//=====================================================================
// Setting the Counter Enable bit
static void turn_periodic_timer_on(void)
{
  uint16_t cr1Val = getreg16(STM32_TIM7_BASE + STM32_BTIM_CR1_OFFSET);
  cr1Val |= BTIM_CR1_CEN;   // counter enable
  putreg16(cr1Val, STM32_TIM7_BASE + STM32_BTIM_CR1_OFFSET);
}

//=====================================================================
static void turn_periodic_timer_off(void)
{
  uint16_t cr1Val = getreg16(STM32_TIM7_BASE + STM32_BTIM_CR1_OFFSET);
  cr1Val &= ~BTIM_CR1_CEN;   // counter enable
  putreg16(cr1Val, STM32_TIM7_BASE + STM32_BTIM_CR1_OFFSET);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/
// Called from meadow-upd.c to configure or remove a gpio for monitoring
int mint_config_interrupt(struct mint_gpio_int_config* cfg)
{
  int ret;
  struct interruptPinMap_s *gpioInfoAddr;

  if(cfg == NULL)
  {
    syslog(LOG_ERR, "%s@%d-ERROR: mint_config_interrupt is NULL\n",
       thisFile, __LINE__);
    return -EINVAL;
  }

  if(cfg->port > 15|| cfg->pin > 15)
  {
    syslog(LOG_ERR, "%s@%d-ERROR: mint_config_interrupt port/pin error\n",
       thisFile, __LINE__);
    return -EINVAL;
  }
  uint8_t pinDesignation = cfg->port << 4 | cfg->pin;

  // If a new GPIO interrupt must have at least one 'edge' defined
  if(cfg->configType == gpio_intrpt_cfg_type_new && \
     cfg->risingEdge == 0 && cfg->fallingEdge == 0)
  {
    syslog(LOG_ERR, "%s@%d-ERROR: mint_config_interrupt edge config type.\n",
       thisFile, __LINE__);
    return -EINVAL;
  }

  // If configured for wakeup, cannot support glitch or debounce filtering 
  // because while in low-power mode the clocks are all stopped.
  if(cfg->configType == gpio_intrpt_cfg_type_wakeup && \
     (cfg->debounceDuration != 0 || cfg->glitchDuration != 0))
  {
    syslog(LOG_ERR, "%s@%d-ERROR: Both glitch and debounce must be 0 for wakeup\n",
       thisFile, __LINE__);
    return -EINVAL;
  }

  if(_firstTimeConfig)
  {
    _allGpiosBeingTimedCnt = 0;
    _firstTimeConfig = false;

    for(int i = 0; i < MEADOW_INTERRUPT_MAX_SUPPORTED_GPIOS; i++)
    {
      _allConfiguredGpios[i] = NULL;
    }

    DEBUG_CONFIGURE_PIN(DEBUG_PIN_V2_A0);    // True while in periodic isr
    DEBUG_CONFIGURE_PIN(DEBUG_PIN_V2_A1);    // True while in no delay isr
    DEBUG_CONFIGURE_PIN(DEBUG_PIN_V2_A2);    // True while in delay isr
    DEBUG_CONFIGURE_PIN(DEBUG_PIN_V2_A3);
    DEBUG_CONFIGURE_PIN(DEBUG_PIN_V2_A4);
    DEBUG_CONFIGURE_PIN(DEBUG_PIN_V2_A5);
    
    DEBUG_SET_LOW(DEBUG_PIN_V2_A0);
    DEBUG_SET_LOW(DEBUG_PIN_V2_A1);
    DEBUG_SET_LOW(DEBUG_PIN_V2_A2);
    DEBUG_SET_LOW(DEBUG_PIN_V2_A3);
    DEBUG_SET_LOW(DEBUG_PIN_V2_A4);
    DEBUG_SET_LOW(DEBUG_PIN_V2_A5);

    // Setup the timer once, the first time
    ret = mint_config_interrupt_prep_timer(MEADOW_INTERRUPT_STM32F7_TIMER_NUMBER);
    if(ret < 0)
    {
      syslog(LOG_ERR, "mint-(cfg)-mint_config_interrupt_prep_timer failed, ret:%d\n", ret);
      return ret;
    }
  }

