WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_interrupt.c
  // Allocate memory for this GPIO's configuration and data storage needs
  gpioInfoAddr = (struct interruptPinMap_s *) zalloc(sizeof (struct interruptPinMap_s));
  if(gpioInfoAddr == NULL)
  {
    syslog(LOG_ERR, "%s@%d-malloc returned NULL\n", __FILE__, __LINE__);
    return -ENOMEM;
  }

  // We must set a few elements in the struct for this configuration
  gpioInfoAddr->PinId = pinDesignation;

  // Find the correct offset for this GPIO
  gpioInfoAddr->IDRAddress = inputDataRegAddrs[cfg->port];
  gpioInfoAddr->CurrentProcessState = mint_state_uncfg;
  gpioInfoAddr->LastKnownGpioState = 0xff;
  gpioInfoAddr->InputUsage = cfg->configType;

  // Setup the Nuttx cfgset for this point to be configured by Nuttx
  uint32_t cfgset = (pinDesignation & 0x000000ff);   // Set Port and Pin and clear MM

  switch (cfg->configType)
  {
  case gpio_intrpt_cfg_type_remove:
    ret = mint_config_interrupt_remove(cfg, gpioInfoAddr);
    break;

  case gpio_intrpt_cfg_type_new:
    ret = mint_config_interrupt_new(cfg, gpioInfoAddr, cfgset);
    break;

  case gpio_intrpt_cfg_type_wakeup:
    ret = mint_config_interrupt_new(cfg, gpioInfoAddr, cfgset);
    break;

  default:
    syslog(LOG_ERR, "%s@%d-ERROR:Illegal configType:%lu\n",
      thisFile, __LINE__, cfg->configType);
    break;
  }

  return ret;
}

//========================================================================
// Remove an existing interrupt entry
int mint_config_interrupt_remove(struct mint_gpio_int_config* cfg,
          struct interruptPinMap_s *gpioInfoAddr)
{
  int ret;

  if(cfg == NULL)
  {
    syslog(LOG_ERR, "%s@%d-ERROR: mint_config_interrupt is NULL\n",
       thisFile, __LINE__);
    return -EINVAL;
  }

  // Disable - remove a GPIO from being monitored
#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 0
  syslog(LOG_INFO, "mint-(cfg)-0x%02x (P%c%d)--Removing GPIO\n", gpioInfoAddr->PinId,
              ((gpioInfoAddr->PinId) >> 4) + 'A', gpioInfoAddr->PinId & 0x0f);
#endif

  // Small chance but it might be actively timing
  mint_remove_from_timed_list_and_decr(gpioInfoAddr);

  // Tell Nuttx to forget about this interrupt
  ret = stm32_gpiosetevent(gpioInfoAddr->PinId, 0, 0, 0, NULL, NULL);

  if(gpioInfoAddr->CurrentProcessState != mint_state_mon_no_delay)
    _totalGpiosCanBeTimed--;   // Keep track only of timed gpios

  gpioInfoAddr->CurrentProcessState = mint_state_uncfg;

  // This call will free the memory allocated when this GPIO was originally
  // configured
  ret = mint_free_gpio_in_allocation_list(gpioInfoAddr->PinId);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-mint_free_gpio_in_allocation_list returned, ret:%d\n",
              __FILE__, __LINE__, ret);
    // Have reported error, might as well finish removing GPIO
  }

  // Free the memory was only allocated a moment ago by the caller to this
  // function.
  free(gpioInfoAddr);
  return ret;
}

//========================================================================
// Add a new interrupt entry
int mint_config_interrupt_new(struct mint_gpio_int_config* cfg,
          struct interruptPinMap_s *gpioInfoAddr, uint32_t cfgset)
{
  int ret;

  // Save the allocated memory so it can be freed when/if GPIO interrupt is
  // disposed of.
  ret = mint_add_new_gpio_to_allocation_list(gpioInfoAddr);
  if(ret < 0)
  {
    syslog(LOG_ERR, "mint-(cfg)-mint_add_new_gpio_to_allocation_list, ret:%d\n", ret);
    return ret;
  }

  // Get the current GPIO state which may be used when processing
  // the interrupt.
  gpioInfoAddr->LastKnownGpioState = mint_read_current_gpio_state(gpioInfoAddr);
  gpioInfoAddr->GlitchPrevGpioState = gpioInfoAddr->LastKnownGpioState;

  // Set both Debounce and Glitch delay times
  // Note: the available configurations are 0.0 (none), 0.1 - 1000 millisec.
  // Foundation.Core will supply a value of 0, 1 - 10000. Since the timer 
  // is set at 100 usec then the count provided is the same as the number
  // of timer timeouts received.
  gpioInfoAddr->DebounceConfiguredDuration = cfg->debounceDuration;
  gpioInfoAddr->GlitchConfiguredDuration = cfg->glitchDuration;
  gpioInfoAddr->GlitchTimeoutsCounter = 0;

  // none = 0, rising = 1, falling = 2 & both = 3 (must match F7GPIOManager_interrupts.cs
  // in WireInterrupt()
  gpioInfoAddr->GpioRiseFallValue = (cfg->risingEdge & 0x01) | (cfg->fallingEdge & 0x01) << 1;

  // cfgset contains 20-bits of data. It is required by the Nuttx stm32_gpiosetevent
  // function. If the 20 bits of data are not correct, this Nuttx function will
  // reconfigure the GPIO based on whatever the data is in cfgset.
  // See stm32_gpio.h for more information.
  // Inputs: MMUU .... ...X PPPP BBBB
  // MM = Mode for input (this is 00)
  // UU = pull up, pull down or float
  // X  = configure as EXTI interrupt. Event or ISR set by stm32_gpiosetevent
  switch(cfg->resistorMode)
  {
    case 0: // Float
      cfgset |= GPIO_FLOAT;
      break;    // 0 = do nothing
    case 1: // Pull up
      cfgset |= GPIO_PULLUP;
      break;
    case 2: // Pull down
      cfgset |= GPIO_PULLDOWN;
      break;
    default:
      syslog(LOG_ERR, "%s@%d-ERROR:Illegal resistorMode:%lu\n",
        thisFile, __LINE__, cfg->resistorMode);
      break;
  }

#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 0
  syslog(LOG_INFO, "mint-(cfg)- 0x%02x (P%c%d)-Cfg Enabled-LKS:%d, GLDuration:%d, DBDuration:%d, RiseFallValue:%d, cfgset:0x%08x\n",
            gpioInfoAddr->PinId,
            ((gpioInfoAddr->PinId) >> 4) + 'A', gpioInfoAddr->PinId & 0x0f,
            gpioInfoAddr->LastKnownGpioState,
            gpioInfoAddr->GlitchConfiguredDuration,
            gpioInfoAddr->DebounceConfiguredDuration,
            gpioInfoAddr->GpioRiseFallValue,
            cfgset);
#endif

  // Tell Nuttx about interrupt parameters
  if(gpioInfoAddr->GlitchConfiguredDuration > 0)
  {
#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 0
    syslog(LOG_INFO, "mint-(cfg)-0x%02x (P%c%d)--Config Glitch\n", gpioInfoAddr->PinId,
                ((gpioInfoAddr->PinId) >> 4) + 'A', gpioInfoAddr->PinId & 0x0f);
#endif
    // Glitch - we must receive both rising and falling or we cannot keep
    // LastKnownGpioState accurately. After a stable state is reached we save
    // this value. Without this we couldn't send rising and falling correctly
    // to Meadow.Core
    // This call also includes stm32_configgpio() to configure the GPIO
    ret = stm32_gpiosetevent(
    cfgset,                     // Nuttx cfgset
    1,                          // risingEdge,
    1,                          // fallingEdge,
    0,                          // event
    mint_gpio_need_delay_isr,   // Need delay GPIO ISR
    gpioInfoAddr);              // GPIO information address

    // If not already configured
    if(gpioInfoAddr->CurrentProcessState == mint_state_uncfg)
        _totalGpiosCanBeTimed++;

    gpioInfoAddr->CurrentProcessState = mint_state_wait_gpio_chg;
  }
  else if(gpioInfoAddr->DebounceConfiguredDuration > 0)
  {
#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 0
    syslog(LOG_INFO, "mint-(cfg)-0x%02x (P%c%d)--Config Debounce\n", gpioInfoAddr->PinId,
                ((gpioInfoAddr->PinId) >> 4) + 'A', gpioInfoAddr->PinId & 0x0f);
#endif
    // Debounce - we cannot know the GPIOs state for certain when we receive
    // the interrupt notification, so we rely on the MCU only sending interrupts
    // based on the rising and falling configuration. For Both (rising and falling)
    // we assume that the state is the opposite of the last know state.
    // This call also includes stm32_configgpio() to configure the GPIO
    ret = stm32_gpiosetevent(
    cfgset,                     // Nuttx cfgset
    cfg->risingEdge,            // risingEdge,
    cfg->fallingEdge,           // fallingEdge,
    0,                          // event
    mint_gpio_need_delay_isr,   // Need delay GPIO ISR
    gpioInfoAddr);              // GPIO information address

    // If not already configured
    if(gpioInfoAddr->CurrentProcessState == mint_state_uncfg)
        _totalGpiosCanBeTimed++;

    gpioInfoAddr->CurrentProcessState = mint_state_wait_gpio_chg;
  }
  else
  {
#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 0
    syslog(LOG_INFO, "mint-(cfg)-0x%02x (P%c%d)--Config NO delay\n", gpioInfoAddr->PinId,
                ((gpioInfoAddr->PinId) >> 4) + 'A', gpioInfoAddr->PinId & 0x0f);
#endif
    // No filtering required. Also used for low-power sleep wakeup.
    // For no delay, as with debounce, we cannot know the GPIOs state for
    // certain when we receive the interrupt notification. So, we immediately
    // read the state and hope for the best.
    // This call also includes stm32_configgpio() to configure the GPIO
    ret = stm32_gpiosetevent(
    cfgset,                   // Nuttx cfgset
    cfg->risingEdge,          // risingEdge,
    cfg->fallingEdge,         // fallingEdge,
    0,                        // event
    mint_gpio_no_delay_isr,   // No delay GPIO ISR
    gpioInfoAddr);            // GPIO information address

    gpioInfoAddr->CurrentProcessState = mint_state_mon_no_delay;
  }
  return ret;
}
